Repository: Decodetalkers/fun-with-kanji
Catalog: assets/l10n/intl_*.arb
Languages: de

source: Learn
de: Lernen

source: Overview
de: Überblick

source: Settings
de: Einstellungen

source: Meanings:
de: Bedeutungen:

source: On readings:
de: On Lesung:

source: Kun readings:
de: Kun Lesung:

source: More info
de: Mehr Informationen

# learnJapaneseLetteringSystems
source: Learn Japanese Writing Systems
de: Lerne japanische Schriftzeichen

# learnJapaneseLetteringSystemsDesc
source: We will learn three writing systems in this app: - Hiragana - Katakana - Kanji
de: Wir werden in dieser App drei Schriftsysteme lernen: - Hiragana - Katakana - Kanji

# hiraganaDesc
source: All starts with the 46 characters of Hiragana and their diagrephics and digraphs. Hiragana is a phonetic writing system which can be used to write all words in the Japanese language.
de: Alles beginnt mit den 46 Zeichen von Hiragana und ihren Digraphen und Digraphen. Hiragana ist ein phonetisches Schreibsystem, mit dem alle Wörter in der japanischen Sprache geschrieben werden können.

# katakanaDesc
source: This is the other phonetic lettering system and is mostly used to write foreign-language words. For each Hiragana there is a Katakana counter part.
de: Dies ist das andere phonetische Buchstabensystem und wird hauptsächlich zum Schreiben von fremdsprachigen Wörtern verwendet. Zu jedem Hiragana gibt es ein Katakana Gegenstück.

# radicalsDesc
source: Kanji Radicals are graphemes, or graphical parts, that are used in organizing Japanese Kanji in dictionaries. They are derived from the 214 Chinese Kangxi radicals. We learn them before we start with Kanji, because Radicals will make it much easier to remember them. Each Kanji is made of one or more Radicals. Just divide a Kanji into it`s Radicals and try to memorize a little story with them. This is the key to bring them into your long-term memory.
de: Kanji Radicals sind Grapheme oder grafische Teile, die beim Organisieren japanischer Kanji in Wörterbüchern verwendet werden. Sie leiten sich von den 214 Chinesischen Kangxi radicals ab. Wir lernen sie, bevor wir mit Kanji beginnen weil Radicals es viel einfacher machen, sich an sie zu erinnern. Jedes Kanji besteht aus einem oder mehreren Radicals. Teile einfach ein Kanji in seine radicals auf und versuche dir eine kleine Geschichte zu jedem einuzprägen. Das ist der Schlüssel, um sie in dein Langzeitgedächtnis zu bringen.

# kanjiDesc
source: Japanese also uses Chinese characters which are called Kanji. This app lists the 2136 Jōyō-Kanji which are taught in Japanese schools. Kanji are not a phonetic lettering system. Each Kanji represents one or multiple words and has a On- and a Kun-reading. But how should it be possible to learn so many characters? Don't worry! For this we have the Kanji Radicals.
de: Japanisch verwendet auch chinesische Schriftzeichen, die Kanji genannt werden. Diese App listet die 2136 Jōyō-Kanji auf, die in japanischen Schulen gelehrt werden. Kanji steht für ein oder mehrere Wörter und at eine On- und eine Kun.Lesung. Aber wie sollte es möglich sein, so viele Schriftzeichen zu lernen? Mach dir keine Sorge! Dafür haben wir die Kanji Radicals.

source: Are you sure?
de: Bist du sicher?

source: Reset learning progress
de: Lernfortschritt zurücksetzen

source: Cancel
de: Abbrechen

source: Reset
de: Zurücksetzen

source: Check
de: Prüfen

source: All stars won
de: Alle Sterne gesammelt

# welcomeText
source: Welcome to Funny Kanji. Together we will learn all Japanese characters you need to read texts in Japanese. It will be a long journey but we will do this step by step.
de: Willkommen bei Fun With Kanji. Gemeinsam lernen wir alle japanischen Schriftzeichen, die du zum Lesen von Texten auf Japanisch benötigst. Es wird ein langer Weg sein, aber wir werden das Schritt für Schritt tun.

source: {count} finished
de: {count} Fertig

source: Import learning progress
de: Lernfortschritt importieren

source: Export learning progress
de: Lernfortschritt exportieren

source: Import finished
de: Import abgeschlossen

# importFailed
source: Sorry... Import failed.
de: Entschuldigung... Import fehlgeschlagen.
